Reports/DMS_ФинансовыйРезультат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>DMS_ФинансовыйРезультат</Name>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/ПродажиАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ПродажиАвтомобилей</Name>
			<Comment>Блок учета продаж автомобилей</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество проданных автомобилей</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Comment>Сумма скидки в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма упр. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СебестоимостьУпр</Name>
					<Comment>Себестоимость упр. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Себестоимость</Name>
					<Comment>Себестоимость регл. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСВходящий</Name>
					<Comment>Сумма входящего НДС в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КолКредит</Name>
					<Comment>Количество в кредит  </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КолТрейдИн</Name>
					<Comment>Количество Trade-In</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КолФизЛица</Name>
					<Comment>Количество проданных физлицам автомобилей</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был зафиксирован факт продажи товара</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Проданный автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Comment>Документ продажи</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтгрузкаАвтомобиляБезРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераЗаАвтомобили</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>Поставщик у которого автомобиль был куплен</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Покупатель</Name>
					<Comment>Покупатель который купил автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Comment>Статус партии, определяющий, чей автомобиль мы продали (собственный компанией или принятый на комиссию)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Comment>Договор взаиморасчетов с покупателем</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании с которого автомобиль был продан</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Comment>Партия</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыПартий</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГТД</Name>
					<Comment>ГТД</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/CRM_ДополнительнаяИнформацияПоАвтомобилям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_ДополнительнаяИнформацияПоАвтомобилям</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПримечаниеРОП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаПродажиРОП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлановаяДатаОплатыАФМ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическаяДатаОплатыАФМ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплатаАФМСогласована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтоОплаченАФМ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлиентВнесАванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлиентПолностьюОплатилАвто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеДляПродажи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦветВыделенияСтрокиДляВсех</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПТСПолученДилером</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СкладПТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖелаемаяДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаВыкупа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПричиныВыкупаАвтоАФМ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительныеЗатратыПоАвто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ТипыАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопКолонка1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.Renault_ДополнительныеПоляАвтосклад</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопКолонка2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.Renault_ДополнительныеПоляАвтосклад</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопКолонка3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.Renault_ДополнительныеПоляАвтосклад</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопКолонка4</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.Renault_ДополнительныеПоляАвтосклад</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопКолонка5</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.Renault_ДополнительныеПоляАвтосклад</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопКолонка6</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.Renault_ДополнительныеПоляАвтосклад</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопКолонка7</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.Renault_ДополнительныеПоляАвтосклад</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопКолонка8</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.Renault_ДополнительныеПоляАвтосклад</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопКолонка9</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.Renault_ДополнительныеПоляАвтосклад</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопКолонка10</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.Renault_ДополнительныеПоляАвтосклад</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаФиксирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаФиксации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Гарантия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПродленнаяГарантия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>SARA</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодАвтомобиляВыкупа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/DMS_ФинансовыйРезультат/Ext/ObjectModule.bsl
Функция ПолучитьТекстЗапроса() Экспорт 

	Возврат "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""BU"" КАК СтатьяДоходовРасходов,
	|	ОборотПродажАвто.Автомобиль КАК Автомобиль,
	|	ОборотПродажАвто.КоличествоОборот КАК Количество,
	|	ОборотПродажАвто.СуммаОборот КАК Сумма,
	|	ОборотПродажАвто.СебестоимостьОборот КАК Себестоимость,
	|	ОборотПродажАвто.СуммаСкидкиОборот КАК СуммаСкидки
	|ПОМЕСТИТЬ мПроданныеАвтомобили
	|ИЗ
	|	РегистрНакопления.ПродажиАвтомобилей.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Авто,
	|			Автомобиль.Модель В (&СписокBU)
	|				И (СкладКомпании.Организация = &Организация
	|					ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))) КАК ОборотПродажАвто
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ДополнительнаяИнформацияПоАвтомобилям КАК ДопИнформацияПоАвтомобилям
	|		ПО ОборотПродажАвто.Автомобиль = ДопИнформацияПоАвтомобилям.Автомобиль
	|			И (ДопИнформацияПоАвтомобилям.ТипАвтомобиля = ЗНАЧЕНИЕ(Справочник.Renault_ТипыАвтомобилей.VND)
	|				ИЛИ ДопИнформацияПоАвтомобилям.ТипАвтомобиля = ЗНАЧЕНИЕ(Справочник.Renault_ТипыАвтомобилей.Демонстрационный))
	|ГДЕ
	|	ДопИнформацияПоАвтомобилям.Автомобиль ЕСТЬ NULL 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Entry"",
	|	ОборотПродажАвто.Автомобиль,
	|	ОборотПродажАвто.КоличествоОборот,
	|	ОборотПродажАвто.СуммаОборот,
	|	ОборотПродажАвто.СебестоимостьОборот,
	|	ОборотПродажАвто.СуммаСкидкиОборот
	|ИЗ
	|	РегистрНакопления.ПродажиАвтомобилей.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Авто,
	|			Автомобиль.Модель В (&СписокEntry)
	|				И (СкладКомпании.Организация = &Организация
	|					ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))) КАК ОборотПродажАвто
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ДополнительнаяИнформацияПоАвтомобилям КАК ДопИнформацияПоАвтомобилям
	|		ПО ОборотПродажАвто.Автомобиль = ДопИнформацияПоАвтомобилям.Автомобиль
	|			И (ДопИнформацияПоАвтомобилям.ТипАвтомобиля = ЗНАЧЕНИЕ(Справочник.Renault_ТипыАвтомобилей.VND)
	|				ИЛИ ДопИнформацияПоАвтомобилям.ТипАвтомобиля = ЗНАЧЕНИЕ(Справочник.Renault_ТипыАвтомобилей.Демонстрационный))
	|ГДЕ
	|	ДопИнформацияПоАвтомобилям.Автомобиль ЕСТЬ NULL 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Прочие_ДЕМО"",
	|	ОборотПродажАвто.Автомобиль,
	|	ОборотПродажАвто.КоличествоОборот,
	|	ОборотПродажАвто.СуммаОборот,
	|	ОборотПродажАвто.СебестоимостьОборот,
	|	ОборотПродажАвто.СуммаСкидкиОборот
	|ИЗ
	|	РегистрНакопления.ПродажиАвтомобилей.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Авто,
	|			СкладКомпании.Организация = &Организация
	|				ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК ОборотПродажАвто
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ДополнительнаяИнформацияПоАвтомобилям КАК ДопИнформацияПоАвтомобилям
	|		ПО ОборотПродажАвто.Автомобиль = ДопИнформацияПоАвтомобилям.Автомобиль
	|			И (ДопИнформацияПоАвтомобилям.ТипАвтомобиля = ЗНАЧЕНИЕ(Справочник.Renault_ТипыАвтомобилей.VND)
	|				ИЛИ ДопИнформацияПоАвтомобилям.ТипАвтомобиля = ЗНАЧЕНИЕ(Справочник.Renault_ТипыАвтомобилей.Демонстрационный))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	мПроданныеАвтомобили.СтатьяДоходовРасходов,
	|	мПроданныеАвтомобили.Автомобиль,
	|	СУММА(мПроданныеАвтомобили.Количество) КАК Количество,
	|	СУММА(мПроданныеАвтомобили.Сумма) КАК Сумма,
	|	СУММА(мПроданныеАвтомобили.СуммаСкидки) КАК СуммаСкидки,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СостоянияАвто.DEALER_PRICE_FULL, 0) = 0
	|			ТОГДА мПроданныеАвтомобили.Себестоимость
	|		ИНАЧЕ ЕСТЬNULL(СостоянияАвто.DEALER_PRICE_FULL, 0)
	|	КОНЕЦ КАК Себестоимость
	|ПОМЕСТИТЬ ПроданныеАвтомобили
	|ИЗ
	|	мПроданныеАвтомобили КАК мПроданныеАвтомобили
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 КАК СостоянияАвто
	|		ПО мПроданныеАвтомобили.Автомобиль.VIN = СостоянияАвто.VIN
	|			И мПроданныеАвтомобили.Автомобиль = СостоянияАвто.Автомобиль
	|
	|СГРУППИРОВАТЬ ПО
	|	мПроданныеАвтомобили.СтатьяДоходовРасходов,
	|	мПроданныеАвтомобили.Автомобиль,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СостоянияАвто.DEALER_PRICE_FULL, 0) = 0
	|			ТОГДА мПроданныеАвтомобили.Себестоимость
	|		ИНАЧЕ ЕСТЬNULL(СостоянияАвто.DEALER_PRICE_FULL, 0)
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ мПроданныеАвтомобили
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВЫРАЗИТЬ(ПродажиТоваров.Регистратор КАК Документ.ЗаказНаряд).ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.КомплектацияАвтомобиля)
	|				ТОГДА ""Выручка ДО (Елки)""
	|			ИНАЧЕ ""Работы ПП""
	|		КОНЕЦ) КАК СтатьяДоходовРасходов,
	|	СУММА(ПродажиТоваров.КоличествоОборот) КАК Количество,
	|	СУММА(ПродажиТоваров.СуммаОборот) КАК Сумма,
	|	СУММА(ПродажиТоваров.СебестоимостьОборот) КАК Себестоимость,
	|	СУММА(ПродажиТоваров.СуммаОборот) КАК Выручка,
	|	СУММА(ВЫБОР
	|			КОГДА ПродажиТоваров.СуммаОборот - ПродажиТоваров.СебестоимостьОборот < 0
	|				ТОГДА -(ПродажиТоваров.СуммаОборот - ПродажиТоваров.СебестоимостьОборот)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ДопРасходы
	|ПОМЕСТИТЬ ПроданныеТовары
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Авто,
	|			Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.Авторабота)
	|				И (СкладКомпании.Организация = &Организация
	|					ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))) КАК ПродажиТоваров
	|ГДЕ
	|	ПродажиТоваров.Регистратор ССЫЛКА Документ.ЗаказНаряд
	|	И ВЫРАЗИТЬ(ПродажиТоваров.Регистратор КАК Документ.ЗаказНаряд).ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ДополнительноеОборудование)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПроданныеАвтомобили.СтатьяДоходовРасходов КАК СтатьяДоходовРасходов,
	|	""Автомобили"" КАК Категория,
	|	ПроданныеАвтомобили.Количество КАК Количество,
	|	ПроданныеАвтомобили.Себестоимость КАК Себестоимость,
	|	ПроданныеАвтомобили.Сумма КАК Сумма,
	|	ПроданныеАвтомобили.Сумма КАК Выручка,
	|	ВЫБОР
	|		КОГДА ПроданныеАвтомобили.Сумма - ПроданныеАвтомобили.Себестоимость < 0
	|			ТОГДА -(ПроданныеАвтомобили.Сумма - ПроданныеАвтомобили.Себестоимость)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДопРасходы
	|ПОМЕСТИТЬ СводнаяТаблица
	|ИЗ
	|	ПроданныеАвтомобили КАК ПроданныеАвтомобили
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПроданныеТовары.СтатьяДоходовРасходов,
	|	""Товары"",
	|	ПроданныеТовары.Количество,
	|	ПроданныеТовары.Себестоимость,
	|	ПроданныеТовары.Сумма,
	|	ПроданныеТовары.Выручка,
	|	ПроданныеТовары.ДопРасходы
	|ИЗ
	|	ПроданныеТовары КАК ПроданныеТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПроданныеТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СводнаяТаблица.Категория КАК Категория,
	|	СУММА(СводнаяТаблица.Количество) КАК Количество_BU,
	|	СУММА(СводнаяТаблица.Себестоимость) КАК Себестоимость_BU,
	|	СУММА(СводнаяТаблица.Сумма) КАК Сумма_BU,
	|	СУММА(СводнаяТаблица.Выручка) КАК Выручка_BU,
	|	СУММА(СводнаяТаблица.ДопРасходы) КАК ДопРасходы_BU,
	|	0 КАК Количество_Entry,
	|	0 КАК Себестоимость_Entry,
	|	0 КАК Сумма_Entry,
	|	0 КАК Выручка_Entry,
	|	0 КАК ДопРасходы_Entry,
	|	0 КАК Количество_Прочие,
	|	0 КАК Себестоимость_Прочие,
	|	0 КАК Сумма_Прочие,
	|	0 КАК Выручка_Прочие,
	|	0 КАК ДопРасходы_Прочие,
	|	0 КАК Количество_ТЦ,
	|	0 КАК Себестоимость_ТЦ,
	|	0 КАК Сумма_ТЦ,
	|	0 КАК Выручка_ТЦ,
	|	0 КАК ДопРасходы_ТЦ,
	|	0 КАК Количество_Елка,
	|	0 КАК Себестоимость_Елка,
	|	0 КАК Сумма_Елка,
	|	0 КАК Выручка_Елка,
	|	0 КАК ДопРасходы_Елка
	|ПОМЕСТИТЬ мВывод
	|ИЗ
	|	СводнаяТаблица КАК СводнаяТаблица
	|ГДЕ
	|	СводнаяТаблица.СтатьяДоходовРасходов = ""BU""
	|
	|СГРУППИРОВАТЬ ПО
	|	СводнаяТаблица.Категория
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СводнаяТаблица.Категория,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	СУММА(СводнаяТаблица.Количество),
	|	СУММА(СводнаяТаблица.Себестоимость),
	|	СУММА(СводнаяТаблица.Сумма),
	|	СУММА(СводнаяТаблица.Выручка),
	|	СУММА(СводнаяТаблица.ДопРасходы),
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	СводнаяТаблица КАК СводнаяТаблица
	|ГДЕ
	|	СводнаяТаблица.СтатьяДоходовРасходов = ""Entry""
	|
	|СГРУППИРОВАТЬ ПО
	|	СводнаяТаблица.Категория
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СводнаяТаблица.Категория,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	СУММА(СводнаяТаблица.Количество),
	|	СУММА(СводнаяТаблица.Себестоимость),
	|	СУММА(СводнаяТаблица.Сумма),
	|	СУММА(СводнаяТаблица.Выручка),
	|	СУММА(СводнаяТаблица.ДопРасходы),
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	СводнаяТаблица КАК СводнаяТаблица
	|ГДЕ
	|	СводнаяТаблица.СтатьяДоходовРасходов = ""Прочие_ДЕМО""
	|
	|СГРУППИРОВАТЬ ПО
	|	СводнаяТаблица.Категория
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СводнаяТаблица.Категория,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	СУММА(СводнаяТаблица.Количество),
	|	СУММА(СводнаяТаблица.Себестоимость),
	|	СУММА(СводнаяТаблица.Сумма),
	|	СУММА(СводнаяТаблица.Выручка),
	|	СУММА(СводнаяТаблица.ДопРасходы),
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	СводнаяТаблица КАК СводнаяТаблица
	|ГДЕ
	|	СводнаяТаблица.СтатьяДоходовРасходов = ""Работы ПП""
	|
	|СГРУППИРОВАТЬ ПО
	|	СводнаяТаблица.Категория
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СводнаяТаблица.Категория,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	СУММА(СводнаяТаблица.Количество),
	|	СУММА(СводнаяТаблица.Себестоимость),
	|	СУММА(СводнаяТаблица.Сумма),
	|	СУММА(СводнаяТаблица.Выручка),
	|	СУММА(СводнаяТаблица.ДопРасходы)
	|ИЗ
	|	СводнаяТаблица КАК СводнаяТаблица
	|ГДЕ
	|	СводнаяТаблица.СтатьяДоходовРасходов = ""Выручка ДО (Елки)""
	|
	|СГРУППИРОВАТЬ ПО
	|	СводнаяТаблица.Категория
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(мВывод.Количество_BU) КАК Количество_BU,
	|	СУММА(мВывод.Себестоимость_BU) КАК Себестоимость_BU,
	|	СУММА(мВывод.Сумма_BU) КАК Сумма_BU,
	|	СУММА(мВывод.Выручка_BU) КАК Выручка_BU,
	|	СУММА(мВывод.ДопРасходы_BU) КАК ДопРасходы_BU,
	|	СУММА(мВывод.Количество_Entry) КАК Количество_Entry,
	|	СУММА(мВывод.Себестоимость_Entry) КАК Себестоимость_Entry,
	|	СУММА(мВывод.Сумма_Entry) КАК Сумма_Entry,
	|	СУММА(мВывод.Выручка_Entry) КАК Выручка_Entry,
	|	СУММА(мВывод.ДопРасходы_Entry) КАК ДопРасходы_Entry,
	|	СУММА(мВывод.Количество_Прочие) КАК Количество_Прочие,
	|	СУММА(мВывод.Себестоимость_Прочие) КАК Себестоимость_Прочие,
	|	СУММА(мВывод.Сумма_Прочие) КАК Сумма_Прочие,
	|	СУММА(мВывод.Выручка_Прочие) КАК Выручка_Прочие,
	|	СУММА(мВывод.ДопРасходы_Прочие) КАК ДопРасходы_Прочие,
	|	СУММА(мВывод.Количество_ТЦ) КАК Количество_ТЦ,
	|	СУММА(мВывод.Себестоимость_ТЦ) КАК Себестоимость_ТЦ,
	|	СУММА(мВывод.Сумма_ТЦ) КАК Сумма_ТЦ,
	|	СУММА(мВывод.Выручка_ТЦ) КАК Выручка_ТЦ,
	|	СУММА(мВывод.ДопРасходы_ТЦ) КАК ДопРасходы_ТЦ,
	|	СУММА(мВывод.Количество_Елка) КАК Количество_Елка,
	|	СУММА(мВывод.Себестоимость_Елка) КАК Себестоимость_Елка,
	|	СУММА(мВывод.Сумма_Елка) КАК Сумма_Елка,
	|	СУММА(мВывод.Выручка_Елка) КАК Выручка_Елка,
	|	СУММА(мВывод.ДопРасходы_Елка) КАК ДопРасходы_Елка
	|ИЗ
	|	мВывод КАК мВывод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СводнаяТаблица.Категория КАК Категория,
	|	СУММА(СводнаяТаблица.Количество) КАК Количество_Авто,
	|	СУММА(СводнаяТаблица.Себестоимость) КАК Себестоимость_Авто,
	|	СУММА(СводнаяТаблица.Сумма) КАК Сумма_Авто,
	|	СУММА(СводнаяТаблица.Выручка) КАК Выручка_Авто,
	|	СУММА(СводнаяТаблица.ДопРасходы) КАК ДопРасходы_Авто
	|ИЗ
	|	СводнаяТаблица КАК СводнаяТаблица
	|ГДЕ
	|	СводнаяТаблица.Категория = ""Автомобили""
	|
	|СГРУППИРОВАТЬ ПО
	|	СводнаяТаблица.Категория
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СводнаяТаблица.Категория КАК Категория,
	|	СУММА(СводнаяТаблица.Количество) КАК Количество_Товары,
	|	СУММА(СводнаяТаблица.Себестоимость) КАК Себестоимость_Товары,
	|	СУММА(СводнаяТаблица.Сумма) КАК Сумма_Товары,
	|	СУММА(СводнаяТаблица.Выручка) КАК Выручка_Товары,
	|	СУММА(СводнаяТаблица.ДопРасходы) КАК ДопРасходы_Товары
	|ИЗ
	|	СводнаяТаблица КАК СводнаяТаблица
	|ГДЕ
	|	СводнаяТаблица.Категория = ""Товары""
	|
	|СГРУППИРОВАТЬ ПО
	|	СводнаяТаблица.Категория
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(СводнаяТаблица.Количество) КАК Количество_Итого,
	|	СУММА(СводнаяТаблица.Себестоимость) КАК Себестоимость_Итого,
	|	СУММА(СводнаяТаблица.Сумма) КАК Сумма_Итого,
	|	СУММА(СводнаяТаблица.Выручка) КАК Выручка_Итого,
	|	СУММА(СводнаяТаблица.ДопРасходы) КАК ДопРасходы_Итого
	|ИЗ
	|	СводнаяТаблица КАК СводнаяТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ мВывод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СводнаяТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПроданныеАвтомобили
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(""Работы ТО и Р"") КАК Категория,
	|	СУММА(ПродажиРаботы.КоличествоОборот) КАК Количество_РаботыТО,
	|	СУММА(ПродажиРаботы.СуммаОборот) КАК Выручка_РаботыТО,
	|	СУММА(ПродажиРаботы.СебестоимостьОборот) КАК Себестоимость_РаботыТО
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Авто,
	|			Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.Авторабота)
	|				И (СкладКомпании.Организация = &Организация
	|					ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))) КАК ПродажиРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ВидыРемонтаДопРеквизиты КАК ВидыРемонта
	|		ПО (ВЫРАЗИТЬ(ПродажиРаботы.Регистратор КАК Документ.ЗаказНаряд).ВидРемонта = ВидыРемонта.ВидРемонта)
	|ГДЕ
	|	ПродажиРаботы.Регистратор ССЫЛКА Документ.ЗаказНаряд
	|	И ВЫРАЗИТЬ(ПродажиРаботы.Регистратор КАК Документ.ЗаказНаряд).Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
	|	И ВЫРАЗИТЬ(ПродажиРаботы.Регистратор КАК Документ.ЗаказНаряд).Пробег > 100
	|	И НЕ ЕСТЬNULL(ВидыРемонта.ГарантияЗавода, ЛОЖЬ)";	

КонецФункции // ПолучитьТекстЗапроса()
